print(4 + 7)          # 4 더하기 7
print(2 - 4)          # 2 빼기 4
print(5 * 3)          # 5 곱하기 3
print(7 % 3)          # 7을 3으로 나눈 나머지
print(2 ** 3)         # 2의 3제곱

print(2 + 3 * 2)      # 덧셈보다 곱셈을 먼저 계산
print(2 * (2 + 3))    # 괄호안의 수식을 먼저 계산

# 결과값이 정수형으로 나옴
print(1 + 2)        # 1 더하기 2
print(6 - 2)        # 6 빼기 2
print(3 * 4)        # 3 곱하기 4
print(11 % 4)       # 11을 4로 나눈 나머지
print(3 ** 2)       # 3의 2제곱

# 나눗셈 예외: 결과값이 소수형으로 나옴
print(7 / 2)        # 7 나누기 2
print(8 / 2)        # 8 나누기 2

print(1.5 + 2.5)
print(1.5 * (2 + 1))
print(3.0 / 2)
print(6 / 3)      # 정수형끼리의 연산이라도 나눗셈 결과는 소수형
print(9.0 % 2)
print(2 ** 3.0)